smartsensingme/esp-mt6701-example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# MT6701 supports a 1 us minimum SCL period (1 MHz maximum). The physical bus
# must keep SDA/SCL rise and fall times below 150 ns at this speed.
CONFIG_APP_I2C_CLOCK_HZ=1000000

# Keep the RTOS tick at 1 kHz; the 4 kHz loop is driven by GPTimer.
CONFIG_FREERTOS_HZ=1000

# Core 0 hosts initialization and system/housekeeping services. The application
# pins the complete sensor/estimator/controller path to Core 1.
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y

# Maximize execution headroom for the 250 us acquisition deadline.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Development-only snapshot diagnostics. Disable the first option to compile
# hot-path instrumentation into no-ops after timing/control validation.
CONFIG_ESP_RT_DIAGNOSTICS_ENABLE=y
CONFIG_ESP_RT_DIAGNOSTICS_DETAILED_TIMING=y
CONFIG_ESP_RT_DIAGNOSTICS_WINDOW_MS=5000

# IBT-2 R_IS conditioning: the board's measured 10 kohm resistor remains in
# place. Add 10 kohm from R_IS to GPIO4, 1 kohm from GPIO4 to GND, a capacitor
# at GPIO4, and external 3.3 V/GND clamps. A series resistor alone is not a
# divider and does not protect a high-impedance ADC input.
CONFIG_ENGINE_CURRENT_SENSE_ENABLE=y
CONFIG_ENGINE_CURRENT_SENSE_GPIO_R_IS=4
CONFIG_ENGINE_CURRENT_SENSE_SAMPLE_HZ=25000
CONFIG_ENGINE_CURRENT_SENSE_BOARD_RESISTOR_OHMS=10000
CONFIG_ENGINE_CURRENT_SENSE_SERIES_RESISTOR_OHMS=10000
CONFIG_ENGINE_CURRENT_SENSE_PULLDOWN_RESISTOR_OHMS=1000
CONFIG_ENGINE_CURRENT_SENSE_RATIO=8500
CONFIG_ENGINE_CURRENT_SENSE_FAULT_ENTER_MV=1500
CONFIG_ENGINE_CURRENT_SENSE_FAULT_EXIT_MV=1000

# Keep the timer-to-task wake path available from internal memory.
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=y
CONFIG_GPTIMER_OBJ_CACHE_SAFE=y
CONFIG_ESP_TIMER_IN_IRAM=y

# These drivers are owned exclusively by the Core 1 task after startup.
# CONFIG_MT6701_THREAD_SAFE is not set
# CONFIG_ENGINE_THREAD_SAFE is not set
